NextFOAM-2506/tutorials/incompressible/simpleFoam/turbineSiting/system/setExprBoundaryFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprBoundaryFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Preload any required fields (optional)
readFields      ( U );

updateBCs
{
    field   windPowerDensity;

    _value1
    {
        target      value;
        variables   ( "rho=1.2" );
        expression  #{ 0.5*rho*pow(mag(U),3) #};
    }

    expressions
    (
        { $_value1; patch inlet; }
        { $_value1; patch outlet; }
        { $_value1; patch sides; }
        { $_value1; patch top; }
    );
}


// ************************************************************************* //
